{"class_name": "Sequential", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"embeddings_constraint": null, "dtype": "float32", "name": "embedding_1", "input_length": 32, "activity_regularizer": null, "input_dim": 17285, "mask_zero": false, "output_dim": 100, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "batch_input_shape": [null, 32], "trainable": true, "embeddings_regularizer": null}}, {"class_name": "LSTM", "config": {"bias_regularizer": null, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "units": 50, "kernel_constraint": null, "recurrent_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "unit_forget_bias": true, "implementation": 1, "trainable": true, "bias_constraint": null, "return_sequences": false, "recurrent_activation": "hard_sigmoid", "return_state": false, "stateful": false, "go_backwards": false, "name": "lstm_1", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.3, "dropout": 0.3, "unroll": false}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "activation": "softmax", "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "dense_1", "units": 3, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}]}, "keras_version": "2.2.4"}