{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 30], "name": "input_1"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 30], "name": "input_2"}, "inbound_nodes": [], "name": "input_2"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 30], "name": "input_3"}, "inbound_nodes": [], "name": "input_3"}, {"class_name": "Embedding", "config": {"input_dim": 3952, "input_length": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "activity_regularizer": null, "batch_input_shape": [null, null], "trainable": true, "name": "embedding_1", "output_dim": 300, "dtype": "float32", "embeddings_constraint": null, "embeddings_regularizer": null, "mask_zero": false}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "embedding_1"}, {"class_name": "Embedding", "config": {"input_dim": 3952, "input_length": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "activity_regularizer": null, "batch_input_shape": [null, null], "trainable": true, "name": "embedding_2", "output_dim": 100, "dtype": "float32", "embeddings_constraint": null, "embeddings_regularizer": null, "mask_zero": false}, "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "embedding_2"}, {"class_name": "Embedding", "config": {"input_dim": 3952, "input_length": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "activity_regularizer": null, "batch_input_shape": [null, null], "trainable": true, "name": "embedding_3", "output_dim": 100, "dtype": "float32", "embeddings_constraint": null, "embeddings_regularizer": null, "mask_zero": false}, "inbound_nodes": [[["input_3", 0, 0, {}]]], "name": "embedding_3"}, {"class_name": "Conv1D", "config": {"data_format": "channels_last", "name": "conv1d_1", "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activity_regularizer": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "trainable": true, "filters": 64, "use_bias": true, "dilation_rate": [1], "bias_constraint": null, "activation": "relu", "kernel_size": [3], "kernel_constraint": null}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]], "name": "conv1d_1"}, {"class_name": "Conv1D", "config": {"data_format": "channels_last", "name": "conv1d_2", "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activity_regularizer": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "trainable": true, "filters": 64, "use_bias": true, "dilation_rate": [1], "bias_constraint": null, "activation": "relu", "kernel_size": [4], "kernel_constraint": null}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]], "name": "conv1d_2"}, {"class_name": "Conv1D", "config": {"data_format": "channels_last", "name": "conv1d_3", "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activity_regularizer": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "trainable": true, "filters": 64, "use_bias": true, "dilation_rate": [1], "bias_constraint": null, "activation": "relu", "kernel_size": [5], "kernel_constraint": null}, "inbound_nodes": [[["embedding_3", 0, 0, {}]]], "name": "conv1d_3"}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "name": "dropout_1", "rate": 0.5, "seed": null}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]], "name": "dropout_1"}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "name": "dropout_2", "rate": 0.5, "seed": null}, "inbound_nodes": [[["conv1d_2", 0, 0, {}]]], "name": "dropout_2"}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "name": "dropout_3", "rate": 0.5, "seed": null}, "inbound_nodes": [[["conv1d_3", 0, 0, {}]]], "name": "dropout_3"}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_1", "data_format": "channels_last", "pool_size": [2], "trainable": true, "strides": [2], "padding": "valid"}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "max_pooling1d_1"}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_2", "data_format": "channels_last", "pool_size": [2], "trainable": true, "strides": [2], "padding": "valid"}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "max_pooling1d_2"}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_3", "data_format": "channels_last", "pool_size": [2], "trainable": true, "strides": [2], "padding": "valid"}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "name": "max_pooling1d_3"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_1", 0, 0, {}]]], "name": "flatten_1"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2", "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_2", 0, 0, {}]]], "name": "flatten_2"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_3", "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_3", 0, 0, {}]]], "name": "flatten_3"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_1", "axis": -1}, "inbound_nodes": [[["flatten_1", 0, 0, {}], ["flatten_2", 0, 0, {}], ["flatten_3", 0, 0, {}]]], "name": "concatenate_1"}, {"class_name": "Dense", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "trainable": true, "use_bias": true, "name": "dense_1", "units": 10, "activation": "relu", "kernel_constraint": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "dense_1"}, {"class_name": "Dense", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "trainable": true, "use_bias": true, "name": "dense_2", "units": 1, "activation": "sigmoid", "kernel_constraint": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dense_2"}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0], ["input_3", 0, 0]], "output_layers": [["dense_2", 0, 0]], "name": "model_1"}, "keras_version": "2.2.4", "backend": "tensorflow"}